Atuoencoder and tcn

Odi je ulaz u autoencoder x,64,25, i onda se to smanji na x,14.
(možda bi trebao ulazi biti x,1,25 i onda se smanjiti na x,14)

tcn-3-0.ipynb

Using TCN library:

input (15631, 64, 25)

TCN:

Model: "model_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 64, 25)]          0         
_________________________________________________________________
tcn_12 (TCN)                 (None, 64, 32)            36288     
_________________________________________________________________
tcn_13 (TCN)                 (None, 64, 14)            6384      
=================================================================
Total params: 42,672
Trainable params: 42,672
Non-trainable params: 0
_________________________________________________________________
None
Model: "model_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 64, 14)]          0         
_________________________________________________________________
tcn_9 (TCN)                  (None, 64, 32)            30720     
_________________________________________________________________
tcn_10 (TCN)                 (None, 16)                8224      
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 17        
=================================================================
Total params: 38,961
Trainable params: 38,961
Non-trainable params: 0
_________________________________________________________________
tcn_12 filters 32
tcn_13 filters 16
tcn_9 filters 32
tcn_10 filters 16
dropout 0,2
dropout 0,2

epochs 100
batch 200
validation split 0,02
===============================
93/93 - 1s - loss: 343.9002 - mean_absolute_error: 13.4724 - r2_keras: 0.7934
