tcn-6.ipynb

multiple window sizes.
idea is to have a couple of tcn with diffrent sizes
output of those will go to NN

         / --> window size 10 --> tcn --> \
        /  --> window size 30 --> tcn -->  \
input >-   --> window size 50 --> tcn -->  -> NN  --> result
        \  --> window size 70 --> tcn -->  /
         \ --> window size 90 --> tcn --> /

each tcn is strip befor dense layer ( input layer, tcn1(12) ,tcn2(6)) and result is concatinated as one vector to NN

Piecewise linear function with zero gradient and unit gradient

		^
		|
MAXLIFE |-----------
		|            \
		|             \
		|              \
		|               \
		|                \
		|----------------------->
					137

MAXLIFE = 137
Using TCN library:

inputs:

(19631, 10, 25)
(17631, 30, 25)
(15631, 50, 25)
(13631, 70, 25)
(11631, 90, 25)

TCNs:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, x, 25)]         0         
_________________________________________________________________
tcn (TCN)                    (None, x, 12)           ---      
_________________________________________________________________
tcn_1 (TCN)                  (None, 6)               ---      
_________________________________________________________________
dense (Dense)                (None, 1)                 7         
=================================================================

_________________________________________________________________
tcn_2 filters 12
tcn_3 filters 6
dropout on TCN 0,2
dropout on TCN 0,2
dilations=[1, 2,4,8,16,32,]
dilations=[1, 2,4,8,16,32,]

epochs 100 no early stop
batch 200
validation split 0,05
loss = root_mean_squared_error
===============================
Results of each tcn:
TCN1 (10):
MAE: 14.043157577514648
R^2: 0.8027997016906738
RMSE: 17.202922821044922

TCN2 (30):
MAE: 11.293447494506836
R^2: 0.8686798810958862
RMSE: 13.809491157531738

TCN3 (50):
MAE: 10.576384544372559
R^2: 0.8659417033195496
RMSE: 14.927990913391113


TCN4 (70);
MAE: 9.128286361694336
R^2: 0.8967368602752686
RMSE: 13.208643913269043

TCN5(90):
MAE: 7.37193489074707
R^2: 0.9325398802757263
RMSE: 10.2377290725708
====================================0

Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 10, 25)]          0         
_________________________________________________________________
tcn_8 (TCN)                  (None, 10, 12)            4692      
_________________________________________________________________
tcn_9 (TCN)                  (None, 6)                 1224      
=================================================================
Total params: 5,916
Trainable params: 5,916
Non-trainable params: 0
_________________________________________________________________
11631/11631 [==============================] - 2s 158us/sample
Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 30, 25)]          0         
_________________________________________________________________
tcn_2 (TCN)                  (None, 30, 12)            4692      
_________________________________________________________________
tcn_3 (TCN)                  (None, 6)                 1224      
=================================================================
Total params: 5,916
Trainable params: 5,916
Non-trainable params: 0
_________________________________________________________________
11631/11631 [==============================] - 3s 237us/sample
Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 50, 25)]          0         
_________________________________________________________________
tcn_4 (TCN)                  (None, 50, 12)            4692      
_________________________________________________________________
tcn_5 (TCN)                  (None, 6)                 1224      
=================================================================
Total params: 5,916
Trainable params: 5,916
Non-trainable params: 0
_________________________________________________________________
11631/11631 [==============================] - 4s 383us/sample
Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 70, 25)]          0         
_________________________________________________________________
tcn_6 (TCN)                  (None, 70, 12)            4692      
_________________________________________________________________
tcn_7 (TCN)                  (None, 6)                 1224      
=================================================================
Total params: 5,916
Trainable params: 5,916
Non-trainable params: 0
_________________________________________________________________
11631/11631 [==============================] - 5s 449us/sample
Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 90, 25)]          0         
_________________________________________________________________
tcn_8 (TCN)                  (None, 90, 12)            4692      
_________________________________________________________________
tcn_9 (TCN)                  (None, 6)                 1224      
=================================================================
Total params: 5,916
Trainable params: 5,916
Non-trainable params: 0
_________________________________________________________________
11631/11631 [==============================] - 6s 509us/sample


LAST layer:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 30)]              0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 31        
=================================================================
Total params: 31
Trainable params: 31
Non-trainable params: 0
_________________________________________________________________

MAE: 6.869684219360352

R^2: 0.9321147799491882

RMSE: 10.2445068359375
