Using tcn dropout, 32 window size, used dilations=[1, 2, 4, 8, 16, 32]
tcn-2-0.ipynb

Using TCN library:

input (15631, 32, 25)

TCN:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 32, 25)]          0         
_________________________________________________________________
tcn_4 (TCN)                  (None, 32, 32)            31072     
_________________________________________________________________
tcn_5 (TCN)                  (None, 16)                8224      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 17        
=================================================================
Total params: 39,313
Trainable params: 39,313
Non-trainable params: 0
_________________________________________________________________
tcn_6 filters 32
tcn_7 filters 16
dropout on tcn layers 0,2
dilations [1, 2, 4, 8, 16, 32]

epochs 100
batch 200
validation split 0,02
===============================

MAE: 13.430752754211426

R^2: 0.8153601884841919

RMSE: 16.607810974121094