Atuoencoder and tcn

autoencoder od NN sa x,25 na x,9
onda u TCN

tcn-3-0.ipynb

Using TCN library:

input (20631, 25)
========================================================================================================================================
========================================================================================================================================
AUTOENCODER:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   activation
=================================================================
input_1 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense (Dense)                (None, 32)                832       relu
_________________________________________________________________
dense_1 (Dense)              (None, 16)                528       relu
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 136       relu
_________________________________________________________________
dense_3 (Dense)              (None, 16)                144       relu
_________________________________________________________________
dense_4 (Dense)              (None, 32)                544       relu
_________________________________________________________________
dense_5 (Dense)              (None, 25)                825       sigmoid
=================================================================
Total params: 3,009
Trainable params: 3,009
Non-trainable params: 0

epochs 200
batchsize 256

========================================================================================================================================
========================================================================================================================================

input (20631, 25)
Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense (Dense)                (None, 32)                832       
_________________________________________________________________
dense_1 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_2 (Dense)              (None, 9)                 136       
=================================================================
Total params: 1,496
Trainable params: 1,496
Non-trainable params: 0
_________________________________________________________________

Stack into x,64,9

_________________________________________________________________
None
input(14231, 64, 9)

Model: "TCN"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 64, 9)]           0         
_________________________________________________________________
tcn (TCN)                    (None, 64, 32)            30560     
_________________________________________________________________
tcn_1 (TCN)                  (None, 16)                8224      
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 17        
=================================================================
Total params: 38,801
Trainable params: 38,801
Non-trainable params: 0
_________________________________________________________________





tcn_9 filters 32
tcn_10 filters 16
dropout 0,2
dropout 0,2

epochs 100
batch 200
validation split 0,02
===============================
MAE: 15.0336332321167

R^2: 0.7440250515937805

RMSE: 20.423473358154297


