Using TCN library:

input (15631, 50, 25)

TCN:
_________________________________________________________________
Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 50, 25)]          0         
_________________________________________________________________
tcn_6 (TCN)                  (None, 50, 32)            31072     
_________________________________________________________________
tcn_7 (TCN)                  (None, 16)                8224      
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 17        
=================================================================
Total params: 39,313
Trainable params: 39,313
Non-trainable params: 0
_________________________________________________________________
tcn_6 filters 32
tcn_7 filters 16

epochs 100
batch 200
validation split 0,02
===============================
