autoencoder2.ipynb

Here are used only 14 sensors  2, 3, 4, 7, 8, 9, 11, 12, 13, 14, 15, 17, 20, and 21
['setting1', 'setting2', 'setting3', 'cycle_norm']

input: (20631, 18)

Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 18)]              0         
_________________________________________________________________
dense_18 (Dense)             (None, 32)                608       
_________________________________________________________________
dense_19 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_20 (Dense)             (None, 8)                 136       
_________________________________________________________________
dense_21 (Dense)             (None, 16)                144       
_________________________________________________________________
dense_22 (Dense)             (None, 32)                544       
_________________________________________________________________
dense_23 (Dense)             (None, 18)                594       
=================================================================
Total params: 2,554
Trainable params: 2,554
Non-trainable params: 0
_________________________________________________________________

Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')
Dense(16, activation='relu')
Dense(32, activation='relu')
Dense(nb_features, activation='sigmoid')

epochs 200
batch 256
===============================
20631/20631 - 
0s - 
loss: 0.0025 - 
mae: 0.0361 - 
r2_keras: 0.9407 - 
root_mean_squared_error: 0.0498 - 
val_loss: 0.0024 - 
val_mae: 0.0355 - 
val_r2_keras: 0.9408 - 
val_root_mean_squared_error: 0.0493


/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
ENCODER
/////////////////////////////////////////////////////////////


input: (20631, 18)

Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 18)]              0         
_________________________________________________________________
dense_18 (Dense)             (None, 32)                608       
_________________________________________________________________
dense_19 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_20 (Dense)             (None, 8)                 136       
=================================================================
Total params: 1,272
Trainable params: 1,272
Non-trainable params: 0
_________________________________________________________________


Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')