Smaller windows

Using TCN library:

input (15631, 30, 25)

TCN:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 30, 25)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 30, 32)            313696    
_________________________________________________________________
dropout (Dropout)            (None, 30, 32)            0         
_________________________________________________________________
tcn_1 (TCN)                  (None, 16)                78880     
_________________________________________________________________
dropout_1 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 17        
=================================================================
Total params: 392,593
Trainable params: 392,593
Non-trainable params: 0
_________________________________________________________________
tcn_6 filters 32
tcn_7 filters 16
dropout 0,2
dropout 0,2

epochs 100
batch 200
validation split 0,02
===============================
MAE: 14.275046348571777

R^2: 0.7902200222015381

RMSE: 16.647464752197266