Using dropout
tcn-2-0.ipynb

Using TCN library:

input (15631, 50, 25)

TCN:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 50, 25)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 50, 32)            313696    
_________________________________________________________________
dropout (Dropout)            (None, 50, 32)            0         
_________________________________________________________________
tcn_1 (TCN)                  (None, 16)                78880     
_________________________________________________________________
dropout_1 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 17        
=================================================================
Total params: 392,593
Trainable params: 392,593
Non-trainable params: 0
_________________________________________________________________
tcn_6 filters 32
tcn_7 filters 16
dropout 0,2
dropout 0,2

epochs 150
batch 200
validation split 0,02
===============================
MAE: 12.211845397949219

R^2: 0.8138236403465271

RMSE: 17.560997009277344