autoencoder.ipynb


input (20631, 25)

Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense_24 (Dense)             (None, 32)                832       
_________________________________________________________________
dense_25 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_26 (Dense)             (None, 8)                 136       
_________________________________________________________________
dense_27 (Dense)             (None, 16)                144       
_________________________________________________________________
dense_28 (Dense)             (None, 32)                544       
_________________________________________________________________
dense_29 (Dense)             (None, 25)                825       
=================================================================
Total params: 3,009
Trainable params: 3,009
Non-trainable params: 0
______________________________________________

Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')
Dense(16, activation='relu')
Dense(32, activation='relu')
Dense(nb_features, activation='sigmoid')

epochs 200
batch 256
===============================
20631/20631 - 0s - 
loss: 0.0021 - 
mae: 0.0281 - 
r2_keras: 0.9728 - 
root_mean_squared_error: 0.0458 - 
val_loss: 0.0021 - 
val_mae: 0.0285 - 
val_r2_keras: 0.9722 - 
val_root_mean_squared_error: 0.0463


/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
ENCODER
/////////////////////////////////////////////////////////////


input (20631, 25)

Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense_24 (Dense)             (None, 32)                832       
_________________________________________________________________
dense_25 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_26 (Dense)             (None, 8)                 136       
=================================================================
Total params: 1,496
Trainable params: 1,496
Non-trainable params: 0
_________________________________________________________________


Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')