Using kernel size 3

Using TCN library:

input (15631, 50, 25)

TCN:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 31, 25)]          0         
_________________________________________________________________
tcn_2 (TCN)                  (None, 31, 32)            36096     
_________________________________________________________________
dropout_2 (Dropout)          (None, 31, 32)            0         
_________________________________________________________________
tcn_3 (TCN)                  (None, 16)                9456      
_________________________________________________________________
dropout_3 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 45,569
Trainable params: 45,569
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
tcn_2: nb_filters=32,kernel_size=3,dilations=[1, 3, 9, 11, 15]
tcn_3: nb_filters=16,kernel_size=3,dilations=[1, 3, 9, 11, 15]
dropout 0,2
dropout 0,2
kernel_size 3

epochs 150
batch 200
validation split 0,05
===============================
MAE: 12.937403678894043

R^2: 0.8092302680015564

RMSE: 16.509363174438477