Atuoencoder and LSTM
LSTM-Autoencoder-1-1.ipynb
autoencoder: autoencoder.ipynb

all sensor and setting values => encoder
encoder => 9 values 
9 values => stacked to 50
(15631, 50, 9) => to LSTM


input to encoder: (20631, 25)
========================================================================================================================================
========================================================================================================================================
ENCODER:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense_24 (Dense)             (None, 32)                832       
_________________________________________________________________
dense_25 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_26 (Dense)             (None, 8)                 136       
=================================================================
Total params: 1,496
Trainable params: 1,496
Non-trainable params: 0
_________________________________________________________________


Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')

========================================================================================================================================
========================================================================================================================================
LSTM:

input (15631, 50, 9)


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 50, 100)           44000     
_________________________________________________________________
dropout_2 (Dropout)          (None, 50, 100)           0         
_________________________________________________________________
lstm_3 (LSTM)                (None, 50)                30200     
_________________________________________________________________
dropout_3 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 51        
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 74,251
Trainable params: 74,251
Non-trainable params: 0
_________________________________________________________________


epochs 150
batch 200
validation split 0,05
===============================
MAE: 13.732390403747559

R^2: 0.7813949584960938

RMSE: 18.756460189819336


