Atuoencoder to smooth values and LSTM
LSTM-Autoencoder-1-2.ipynb
autoencoder: autoencoder.ipynb

all sensor and setting values => autoencoder
autoencoder => all values 
9 values => stacked to 50
(15631, 50, 25) => to LSTM


input to encoder: (20631, 25)
========================================================================================================================================
========================================================================================================================================
AUTOENCODER:

_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense_24 (Dense)             (None, 32)                832       
_________________________________________________________________
dense_25 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_26 (Dense)             (None, 8)                 136       
_________________________________________________________________
dense_27 (Dense)             (None, 16)                144       
_________________________________________________________________
dense_28 (Dense)             (None, 32)                544       
_________________________________________________________________
dense_29 (Dense)             (None, 25)                825       
=================================================================
Total params: 3,009
Trainable params: 3,009
Non-trainable params: 0
_________________________________________________________________


Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')
Dense(16, activation='relu')
Dense(32, activation='relu')
Dense(nb_features, activation='sigmoid')

========================================================================================================================================
========================================================================================================================================
LSTM:

input (15631, 50, 25)



_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 50, 100)           50400     
_________________________________________________________________
dropout_2 (Dropout)          (None, 50, 100)           0         
_________________________________________________________________
lstm_3 (LSTM)                (None, 50)                30200     
_________________________________________________________________
dropout_3 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 51        
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 80,651
Trainable params: 80,651
Non-trainable params: 0
_________________________________________________________________


epochs 150
batch 200
validation split 0,05
===============================

MAE: 14.27540397644043

R^2: 0.7771084904670715

RMSE: 19.1650447845459


