Using TCN library:

input (15631, 50, 25)

TCN:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 50, 25)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 64)                121536    
_________________________________________________________________
dense (Dense)                (None, 1)                 65        
=================================================================
Total params: 121,601
Trainable params: 121,601
Non-trainable params: 0

epochs 100
batch 200
validation split 0,02
===============================
