Atuoencoder and LSTM
LSTM-Autoencoder-2-2.ipynb
autoencoder: autoencoder2.ipynb

selected 14 sensor and all setting values (20631, 18) => autoencoder
autoencoder => 18 values 
18 values => stacked to 50
(15631, 50, 18) => to LSTM


input to autoencoder: 
========================================================================================================================================
========================================================================================================================================
AUTOENCODER:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 18)]              0         
_________________________________________________________________
dense_18 (Dense)             (None, 32)                608       
_________________________________________________________________
dense_19 (Dense)             (None, 16)                528       
_________________________________________________________________
dense_20 (Dense)             (None, 8)                 136       
_________________________________________________________________
dense_21 (Dense)             (None, 16)                144       
_________________________________________________________________
dense_22 (Dense)             (None, 32)                544       
_________________________________________________________________
dense_23 (Dense)             (None, 18)                594       
=================================================================
Total params: 2,554
Trainable params: 2,554
Non-trainable params: 0
_____________________________________________________________



Dense(32, activation='relu')
Dense(16, activation='relu')
Dense(8, activation='relu')
Dense(16, activation='relu')
Dense(32, activation='relu')
Dense(nb_features, activation='sigmoid')

========================================================================================================================================
========================================================================================================================================
LSTM:

input (15631, 50, 9)


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 50, 100)           47600     
_________________________________________________________________
dropout (Dropout)            (None, 50, 100)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 50)                30200     
_________________________________________________________________
dropout_1 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 51        
_________________________________________________________________
activation (Activation)      (None, 1)                 0         
=================================================================
Total params: 77,851
Trainable params: 77,851
Non-trainable params: 0
_________________________________________________________________


epochs 150
batch 200
validation split 0,05
===============================
MAE: 12.783437728881836

R^2: 0.7933616042137146

RMSE: 18.418182373046875

