Atuoencoder and tcn

autoencoder od NN sa x,25 na x,8
onda u TCN

tcn-3-2.ipynb

Using TCN library:

input (20631, 25)
========================================================================================================================================
========================================================================================================================================
AUTOENCODER:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   activation
=================================================================
input_1 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense (Dense)                (None, 32)                832       relu
_________________________________________________________________
dense_1 (Dense)              (None, 16)                528       relu
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 136       relu
_________________________________________________________________
dense_3 (Dense)              (None, 16)                144       relu
_________________________________________________________________
dense_4 (Dense)              (None, 32)                544       relu
_________________________________________________________________
dense_5 (Dense)              (None, 25)                825       sigmoid
=================================================================
Total params: 3,009
Trainable params: 3,009
Non-trainable params: 0

epochs 200
batchsize 256

========================================================================================================================================
========================================================================================================================================

input (20631, 25)
Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 25)]              0         
_________________________________________________________________
dense (Dense)                (None, 32)                832       
_________________________________________________________________
dense_1 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 136       
=================================================================
Total params: 1,496
Trainable params: 1,496
Non-trainable params: 0
_________________________________________________________________

Stack into x,64,9

_________________________________________________________________
None
(14231, 64, 9)

Model: "TCN"

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 64, 9)]           0         
_________________________________________________________________
tcn (TCN)                    (None, 64, 9)             2592      
_________________________________________________________________
tcn_1 (TCN)                  (None, 5)                 860       
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 6         
=================================================================
Total params: 3,458
Trainable params: 3,458
Non-trainable params: 0
_________________________________________________________________

tcn filters 9
tcn_1 filters 5
dilations=[1, 2, 4, 8, 16, 32]
dilations=[1, 2, 4, 8, 16, 32]
dropout 0,2
dropout 0,2

epochs 100
batch 200
validation split 0,05
===============================

MAE: 15.35034465789795

R^2: 0.7056943774223328

RMSE: 21.97520637512207


